app/controllers/cards_controller.rb

    def index
        @cards = Card.all
---
SELECT "cards".* FROM "cards"

    def create
        puts ">>>> CREATE: #{params}"

        @card = Card.new(card_params)

        if @card.save
---
INSERT INTO "cards" ("question", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question", "Ruby is a dynamic language. T or F?"], ["answer", "T"], ["created_at", "2019-12-30 15:16:04.803321"], ["updated_at", "2019-12-30 15:16:04.803321"]]

    def update
        puts ">>>> UPDATE: #{params}"

        @card = Card.find(params[:id])

        if @card.update(card_params)
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "cards" SET "answer" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["answer", "F"], ["updated_at", "2019-12-30 18:54:44.985352"], ["id", 3]]

    def destroy
        puts ">>>> DESTROY: #{params}"

        @card = Card.find(params[:id])
        @card.destroy
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 4]]

        def updated_cards
            @cards = Card.all
---
SELECT "cards".* FROM "cards"