app/controllers/comments_controller.rb

    def create
        @lesson = Lesson.find(params[:lesson_id])
        @coment = @lesson.comments.create(comment_params)
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "lesson_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "lenny"], ["body", "oh yeah"], ["lesson_id", 3], ["created_at", "2019-12-24 12:55:27.156489"], ["updated_at", "2019-12-24 12:55:27.156489"]]