app/controllers/lessons_controller.rb

SELECT  "lessons".* FROM "lessons" ORDER BY "lessons"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @lessons = Lesson.all

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show
        @lesson = Lesson.find(params[:id])

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @lesson = Lesson.find(params[:id])

INSERT INTO "lessons" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "What is JS"], ["text", "JS is a programming language that runs in a browser"], ["created_at", "2019-12-28 21:54:40.046049"], ["updated_at", "2019-12-28 21:54:40.046049"]]
---
    def create
        # inspect params
        # render plain: params[:lesson].inspect

        # NOT SECURE
        # @lesson = Lesson.new(params[:lesson])

        @lesson = Lesson.new(lesson_params)

        # @lesson.save returns `false` if validation fails
        if @lesson.save

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lessons" SET "title" = ?, "updated_at" = ? WHERE "lessons"."id" = ?  [["title", "asdase"], ["updated_at", "2019-12-24 14:42:55.310527"], ["id", 1]]
---
    def update
        @lesson = Lesson.find(params[:id])

        if @lesson.update(lesson_params)

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lessons" WHERE "lessons"."id" = ?  [["id", 1]]
---
    def destroy
        puts ">>>>> #{params}"
        @lesson = Lesson.find(params[:id])
        puts ">>>> #{@lesson}"
        @lesson.destroy

SELECT  "lessons".* FROM "lessons" ORDER BY "lessons"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def blah
        @lesson = Lesson.first